const _0x576c12 = _0x15ed;
(function (_0x325b84, _0x17ae13) {
    const _0x431c79 = _0x15ed;
    const _0x3c5847 = _0x325b84();
    while (!![]) {
        try {
            const _0x24d752 = parseInt(_0x431c79(0x5d)) / 0x1 + -parseInt(_0x431c79(0x35)) / 0x2 * (parseInt(_0x431c79(0x3b)) / 0x3) + parseInt(_0x431c79(0x2c)) / 0x4 + parseInt(_0x431c79(0x1c)) / 0x5 * (-parseInt(_0x431c79(0x50)) / 0x6) + -parseInt(_0x431c79(0x6)) / 0x7 * (-parseInt(_0x431c79(0x43)) / 0x8) + parseInt(_0x431c79(0x1a)) / 0x9 * (-parseInt(_0x431c79(0x8)) / 0xa) + -parseInt(_0x431c79(0x5b)) / 0xb * (parseInt(_0x431c79(0x42)) / 0xc);
            if (_0x24d752 === _0x17ae13) {
                break;
            } else {
                _0x3c5847['push'](_0x3c5847['shift']());
            }
        } catch (_0xd3a2d6) {
            _0x3c5847['push'](_0x3c5847['shift']());
        }
    }
}(_0x2d13, 0x8cfac));
const handler = async (_0x2fa028, {
    conn: _0x502c65,
    usedPrefix: _0x16f61e,
    command: _0xcf1a64,
    args: _0x1487dd,
    isOwner: _0x774970,
    isAdmin: _0x3b8fe6,
    isROwner: _0x33870d
}) => {
    const _0x2baeaa = _0x15ed;
    const _0x32b138 = (global['veeeee'] + _0x2baeaa(0x14) + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x20) + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x22) + (_0x16f61e + _0xcf1a64) + ' مضاداللينكات\x0a*الحاله:* تشغيل او ايقاف مضاد لينكات الواتس.\x0a*الحاله:* يجب ان يكون مفعلا.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔗 | مضاد اللنكات 2\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x3d) + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x41) + (_0x16f61e + _0xcf1a64) + ' كشف2\x0a*الوصف:* يكشف التعديلات في المجموعه و يحافظ علي اداره افضل.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* ❗ | يقيد\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x2e) + (_0x16f61e + _0xcf1a64) + ' الصحين\x0a*الوصف:* فتح او قفل القرائه التلقائي.\x0a*الحاله:* المطور بس الي بيتسعمل الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔊 |  اصوات\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x44) + (_0x16f61e + _0xcf1a64) + ' ستيكرتلقائي \x0a*الوصف:*تصبح جميع الصور أو مقاطع الفيديو المرسلة في المجموعة ملصقات. \x0a\x0a--------------------------------\x0a\x0a*الخيار:* 💬 | خاص فقط\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x57) + (_0x16f61e + _0xcf1a64) + ' جروبات\x0a*الوصف:* البوت هيشتغل في الجروبات بس. \x0a*الحاله:* المكور بس الي يستخدم الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* ❌ | مضاد الاخفاء\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x4d) + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x33) + (_0x16f61e + _0xcf1a64) + ' مضادالخاص\x0a*الوصف:* يبلك اي حد يكلم البوت خاص. \x0a*الحاله:* المطور بس الي يستخدم الامرد ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🤬 | مضاد الشتائم\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + ' مضادالشتائم\x0a*الوصف:* يقوم بتحذير اي شخص سب او شتم او كتب شئ عيب واذا تجاوذ التحذيرات يقوم بطرده.\x0a*الحاله:* يجب ان يكون التقيد مفعلا.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🤖 | البوت الفرعي\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + ' البوت-الفرعي\x0a*الحاله:* تفعيل و اقاف امر (' + _0x16f61e + _0x2baeaa(0x2f) + _0x16f61e + _0x2baeaa(0xf) + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x4c) + (_0x16f61e + _0xcf1a64) + ' سمسمي\x0a*الوصف:* هيبدا البوت يرد باستخدام الذكاء الصتناعي سمسمي.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* ⏳ | مضاد الاسبام\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + ' مضادالاسبام\x0a*الوصف:* يكتشف البوت بعد ارسال 5 رسائل و يحظر المستخدم.\x0a*الخاله:* المطور بس الي يستخدم الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🛡️ | مضاد الحذف\x0a*الامر:* ' + (_0x16f61e + _0xcf1a64) + _0x2baeaa(0x61) + (_0x16f61e + _0xcf1a64) + ' اصوات_البوت\x0a*الوصف:* يتم الغاء جميعرالصوات الخاصه بالبوت .\x0a*الحاله:* المطور بس الي يستخدم الامر ده.')['trim']();
    const _0x36ea17 = /true|افتح|enable|(turn)?on|1/i ['test'](_0xcf1a64);
    const _0x1bab7c = global['db']['data'][_0x2baeaa(0x9)][_0x2fa028['chat']];
    const _0xa1423b = global['db']['data']['users'][_0x2fa028[_0x2baeaa(0x48)]];
    const _0x1c30d0 = global['db'][_0x2baeaa(0x3a)]['settings'][_0x502c65['user'][_0x2baeaa(0x19)]] || {};
    const _0x1eab34 = (_0x1487dd[0x0] || '')[_0x2baeaa(0x3e)]();
    let _0x1e84e5 = ![];
    const _0x7e560b = ![];
    switch (_0x1eab34) {
    case _0x2baeaa(0x39):
        if (!_0x2fa028[_0x2baeaa(0xe)]) {
            if (!_0x774970) {
                global['dfail'](_0x2baeaa(0x5e), _0x2fa028, _0x502c65);
                throw ![];
            }
        } else if (!(_0x3b8fe6 || _0x774970 || _0x33870d)) {
            global[_0x2baeaa(0xc)]('admin', _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1bab7c[_0x2baeaa(0x2)] = _0x36ea17;
        break;
    case _0x2baeaa(0x4a):
        if (!_0x2fa028[_0x2baeaa(0xe)]) {
            if (!_0x774970) {
                global[_0x2baeaa(0xc)]('group', _0x2fa028, _0x502c65);
                throw ![];
            }
        } else if (!_0x3b8fe6) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1bab7c[_0x2baeaa(0x5)] = _0x36ea17;
        break;
    case _0x2baeaa(0x15):
        if (!_0x2fa028[_0x2baeaa(0xe)]) {
            if (!_0x774970) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x5e), _0x2fa028, _0x502c65);
                throw ![];
            }
        } else if (!_0x3b8fe6) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1bab7c[_0x2baeaa(0x12)] = _0x36ea17;
        break;
    case _0x2baeaa(0x13):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c['simi'] = _0x36ea17;
        break;
    case _0x2baeaa(0x54):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x54)] = _0x36ea17;
        break;
    case 'delete':
        if (_0x2fa028['isGroup']) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x4)] = _0x36ea17;
        break;
    case _0x2baeaa(0x7):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)]('admin', _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c['antidelete'] = _0x36ea17;
        break;
    case _0x2baeaa(0x1b):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        global[_0x2baeaa(0x4f)][_0x2baeaa(0x18)] = !_0x36ea17;
        break;
    case _0x2baeaa(0x24):
        if (_0x2fa028['isGroup']) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c['antiLink'] = _0x36ea17;
        break;
    case _0x2baeaa(0x58):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x26)] = _0x36ea17;
        break;
    case _0x2baeaa(0x4b):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x31)] = _0x36ea17;
        break;
    case _0x2baeaa(0x62):
        if (_0x2fa028['isGroup']) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x62)] = _0x36ea17;
        break;
    case _0x2baeaa(0x34):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)]('admin', _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x1e)] = _0x36ea17;
        break;
    case 'ستيكرتلقائي':
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x3c)] = _0x36ea17;
        break;
    case _0x2baeaa(0x25):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global['dfail'](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c['audios'] = _0x36ea17;
        break;
    case 'تقيد':
        _0x1e84e5 = !![];
        if (!_0x774970) {
            global[_0x2baeaa(0xc)]('owner', _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1c30d0[_0x2baeaa(0x30)] = _0x36ea17;
        break;
    case 'اصوات_البوت':
        _0x1e84e5 = !![];
        if (!_0x774970) {
            global['dfail'](_0x2baeaa(0x56), _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1c30d0['audios_bot'] = _0x36ea17;
        break;
    case _0x2baeaa(0x55):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        global[_0x2baeaa(0x4f)][_0x2baeaa(0x55)] = _0x36ea17;
        break;
    case _0x2baeaa(0x5c):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1c30d0['autoread2'] = _0x36ea17;
        global[_0x2baeaa(0x4f)][_0x2baeaa(0x29)] = _0x36ea17;
        break;
    case _0x2baeaa(0xa):
    case 'privateonly':
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        global[_0x2baeaa(0x4f)][_0x2baeaa(0x23)] = _0x36ea17;
        break;
    case 'جروبات':
    case _0x2baeaa(0x32):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        global[_0x2baeaa(0x4f)][_0x2baeaa(0x45)] = _0x36ea17;
        break;
    case _0x2baeaa(0x17):
    case _0x2baeaa(0x2b):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global[_0x2baeaa(0xc)]('rowner', _0x2fa028, _0x502c65);
            throw ![];
        }
        global['opts'][_0x2baeaa(0x17)] = _0x36ea17;
        break;
    case _0x2baeaa(0xb):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1c30d0[_0x2baeaa(0x53)] = _0x36ea17;
        break;
    case _0x2baeaa(0x38):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global['dfail'](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1c30d0[_0x2baeaa(0x10)] = _0x36ea17;
        break;
    case _0x2baeaa(0x3):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global['dfail'](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1c30d0[_0x2baeaa(0x0)] = _0x36ea17;
        break;
    case _0x2baeaa(0x60):
        _0x1e84e5 = !![];
        if (!_0x33870d) {
            global[_0x2baeaa(0xc)](_0x2baeaa(0x5f), _0x2fa028, _0x502c65);
            throw ![];
        }
        _0x1c30d0[_0x2baeaa(0x28)] = _0x36ea17;
        break;
    case _0x2baeaa(0x59):
        if (_0x2fa028['isGroup']) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x5a)] = _0x36ea17;
        break;
    case _0x2baeaa(0x40):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x3f)] = _0x36ea17;
        break;
    case _0x2baeaa(0x1d):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)]('admin', _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x2d)] = _0x36ea17;
        break;
    case _0x2baeaa(0x21):
        if (_0x2fa028[_0x2baeaa(0xe)]) {
            if (!(_0x3b8fe6 || _0x774970)) {
                global[_0x2baeaa(0xc)](_0x2baeaa(0x27), _0x2fa028, _0x502c65);
                throw ![];
            }
        }
        _0x1bab7c[_0x2baeaa(0x46)] = _0x36ea17;
        break;
    default:
        if (!/[01]/ [_0x2baeaa(0x1f)](_0xcf1a64)) return await _0x502c65[_0x2baeaa(0x11)](_0x2fa028[_0x2baeaa(0x2a)], {
            'text': _0x32b138
        }, {
            'quoted': _0x2fa028
        });
        throw ![];
    }
    _0x502c65[_0x2baeaa(0x11)](_0x2fa028[_0x2baeaa(0x2a)], {
        'text': '🗂️ الخيار: ' + _0x1eab34 + '\x0a🎚️ ولايه: ' + (_0x36ea17 ? _0x2baeaa(0x49) : _0x2baeaa(0x4e)) + _0x2baeaa(0x1) + (_0x1e84e5 ? _0x2baeaa(0x47) : _0x7e560b ? '' : _0x2baeaa(0x51))
    }, {
        'quoted': _0x2fa028
    });
};

function _0x2d13() {
    const _0x34838d = ['nyimak', 'owner', ' برايفت\x0a*الوصف:* سوف يستجيب البوت في الخاص بس.\x0a*الحاله:* المطور بس الي يقدر يستعمل الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🏢 | جروبات فقط\x0a*الامر:* ', 'مضاداللينكات2', 'مضادالشتائم', 'antiToxic', '926706xBdNNC', 'الصحين', '969840YRtpfG', 'group', 'rowner', 'مضادالاسبام', ' مضادالحذف\x0a*الوصف:* يكتشف البوت الرساله المحذوفه و يقوم بتحويلها للمستخدم.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔊 | صوت_بوت\x0a*الامر:* ', 'modohorny', 'modejadibot', '\x0a📣 ل: ', 'welcome', 'البوت-الفرعي', 'delete', 'detect', '7PJZfDw', 'مضادالحذف', '30mabEZB', 'chats', 'برايفت', 'مضادالمكالمات', 'dfail', 'help', 'isGroup', 'jadibot). \x0a*الحاله:* المطور بس الي يقدر يستعمل الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 👑 | الادمن\x0a*الامر:* ', 'antiPrivate', 'sendMessage', 'detect2', 'سمسمي', '\x0a°°°°°°°°°°°°°°°°°°°°°°°°°°°°°\x0a*الخيار:* ✨ | الترحيب\x0a*الامر:* ', 'كشف2', 'tags', 'swonly', 'self', 'jid', '619155UKTrmD', 'عام', '695WMKZTh', 'antiarabes', 'modoadmin', 'test', ' الترحيب\x0a*الوصف:* فتح او قفل الترحيب في الجروب.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🌎 | مود العام\x0a*الامر:* ', 'antiarabes2', ' عام\x0a*الوصف:* يصبح البوت علنا او خاصا.\x0a*الحاله:* لا يمكن استخدام هذا الامر الا بواسطه المطور.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔗 | مضاد اللينكات\x0a*الامر:* ', 'pconly', 'مضادالينكات', 'اصوات', 'antiLink2', 'admin', 'antispam', 'autoread', 'chat', 'statusonly', '4469232NjTRxX', 'antiArab', ' تقيد\x0a*وصف:* فتح او قفل قيود البوت مثلا  يطرد و يضيفه.\x0a*حاله:* المطور بس الي يستعمل الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* ☑️ | القرائه التلقائي\x0a*الامر:* ', 'serbot / ', 'restrict', 'antiviewonce', 'grouponly', ' مضادالاتصال\x0a*الوصف:* يبلك اي حد يرن علي رقم البوت. \x0a*الحاله:* المطور بس الي يستخدم الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخاله:* 💬 | مضاد الخاص\x0a*الامر:* ', 'الادمن-فقط', '367790qALrOo', 'map', 'command', 'مضادالخاص', 'الترحيب', 'data', '15utJBfA', 'autosticker', ' مضاداللينكات2\x0a*الوصف:* تشغيل وا اقاف مضاد اي لنكات.\x0a*الحاله:* يجب ان يكون مفعلا.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔎 | كشف\x0a*الامر:* ', 'toLowerCase', 'antiTraba', 'antitraba', ' كشف\x0a*:* تنشيط او الغاء التعديل علي الوصف.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔎 | كشف 2\x0a*الامر:* ', '96gnnqeO', '2724712VyyPGS', ' اصوات\x0a*الوصف:* فتح او قفل الريكات في الجروب.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 👾 | ستيكر تلقائي\x0a*الامر:* ', 'gconly', 'antiArab2', 'هذا البوت', 'sender', 'شغال', 'كشف', 'مضادالاخفاء', ' الادمن-فقط\x0a*الوصف:* سوف يجيب البوت علي الادمن فقط.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 😃 | سمسمي\x0a*الامر:* ', ' مضادالاخفاء\x0a*الوصف:* الصوره او الفيديو الذي يبعت ليرا مره واحده يبعت من البوت مره اخري بشكل طبيعي. \x0a\x0a--------------------------------\x0a\x0a*الخيار:* 📵 | ممنوع الاتصال\x0a*الامر:* ', 'قافل', 'opts', '2178kcTujY', 'هذا الدردشه', 'able <option>', 'antiCall', 'antiporno'];
    _0x2d13 = function () {
        return _0x34838d;
    };
    return _0x2d13();
}
handler[_0x576c12(0xd)] = ['en', 'dis'][_0x576c12(0x36)](_0x42dbf2 => _0x42dbf2 + _0x576c12(0x52));

function _0x15ed(_0x5e1c4d, _0x2d132f) {
    const _0x15ed67 = _0x2d13();
    _0x15ed = function (_0x2629f0, _0x16fd7a) {
        _0x2629f0 = _0x2629f0 - 0x0;
        let _0x19744b = _0x15ed67[_0x2629f0];
        return _0x19744b;
    };
    return _0x15ed(_0x5e1c4d, _0x2d132f);
}
handler[_0x576c12(0x16)] = [_0x576c12(0x5e), _0x576c12(0x56)];
handler[_0x576c12(0x37)] = /^((en|dis)able|ا(فتح|قفل)|(turn)?[01])$/i;
export default handler;
